app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"
---
  def index
    @carts = Cart.all

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    begin
      @cart = Cart.find(params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 15 Jul 2012 08:36:36 UTC +00:00], ["updated_at", Sun, 15 Jul 2012 08:36:36 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart = Cart.find(params[:id])

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 3]]
---
  def destroy
    @cart = current_cart
    @cart.destroy