app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    session[:counter] = 0

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 15 Jul 2012 08:53:09 UTC +00:00], ["updated_at", Sun, 15 Jul 2012 08:53:09 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 72], ["created_at", Fri, 20 Jul 2012 14:36:38 UTC +00:00], ["order_id", nil], ["product_id", 3], ["quantity", 1], ["updated_at", Fri, 20 Jul 2012 14:36:38 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-07-17 04:47:26.579176' WHERE "line_items"."id" = 12

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy

    respond_to do |format|
      if LineItem.find_by_cart_id(@line_item.cart_id).nil?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "46"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 46]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 6]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 6 LIMIT 1

  def decrease
    @cart = current_cart
    @line_item = @cart.decrease_line_item_quantity(params[:id])

    respond_to do |format|
      if @line_item.save
---
UPDATE "line_items" SET "quantity" = 3, "updated_at" = '2012-07-19 11:34:51.431553' WHERE "line_items"."id" = 135

  def increase
    @cart = current_cart
    @line_item = @cart.increase_line_item_quantity(params[:id])

    respond_to do |format|
      if @line_item.save
---
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-07-19 11:33:56.345592' WHERE "line_items"."id" = 136