app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc', per_page: 10

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @order = Order.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 72
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 72
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 22 Jul 2012 15:03:49 UTC +00:00], ["updated_at", Sun, 22 Jul 2012 15:03:49 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 73]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @order = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy