app/controllers/store_controller.rb

SELECT "products".* FROM "products" WHERE "products"."locale" = 'zh_CN'
---
	def index
		if params[:set_locale]
      	  	redirect_to store_path(locale: params[:set_locale])
    	else
			@cart = current_cart
			@products = Product.find(:all, :conditions => {:locale => I18n.locale})