app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "name" = 'Young', "password_digest" = '$2a$10$25eurz2xHjqGNdL.hq59ZO9wzTJ242nudGyTO11X5MzCvqrN6dj6S', "updated_at" = '2012-07-23 13:21:50.426068' WHERE "users"."id" = 3

  def destroy
    @user = User.find(params[:id])

    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]